{
  "REQUEST_EMPTY": {
    "message": "Describe the job or action you want me to handle before continuing.",
    "hint": "Share a short prompt so I can draft the plan."
  },
  "AUTH_MISSING": {
    "message": "Include your API token so I can link this request to your identity.",
    "hint": "Start identity setup if you haven’t yet or paste the token under Advanced → API token."
  },
  "AUTH_INVALID": {
    "message": "Your API token didn’t match an active identity.",
    "hint": "Refresh your credentials or restart identity setup, then resend the request."
  },
  "IDENTITY_SETUP_REQUIRED": {
    "message": "Finish identity verification in the Agent Gateway before using this one-box flow.",
    "hint": "Complete the onboarding checklist so I can trust and execute actions for you."
  },
  "STAKE_REQUIRED": {
    "message": "Stake the minimum AGIALPHA before continuing.",
    "hint": "Add funds or reduce the job’s stake requirement, then rerun the plan."
  },
  "INSUFFICIENT_BALANCE": {
    "message": "You need more AGIALPHA available to cover the reward and stake.",
    "hint": "Top up the funding wallet or lower the reward before retrying."
  },
  "INSUFFICIENT_ALLOWANCE": {
    "message": "Approve AGIALPHA spending from your wallet so I can move the staked funds for you.",
    "hint": "Confirm the token allowance in your wallet or Expert mode, then execute again."
  },
  "DEADLINE_INVALID": {
    "message": "Choose a deadline at least 24 hours out and within the protocol’s maximum window.",
    "hint": "Adjust the deadline days to fit within policy and resimulate."
  },
  "AA_PAYMASTER_REJECTED": {
    "message": "The account abstraction paymaster rejected this request.",
    "hint": "Retry shortly or submit the transaction manually if the sponsor is depleted."
  },
  "AA_SIMULATION_FAILED": {
    "message": "The bundler simulation rejected this account abstraction request.",
    "hint": "Review the encoded call data or execute the transaction manually in wallet mode."
  },
  "PAYMASTER_REJECTED": {
    "message": "The account-abstraction paymaster rejected the request.",
    "hint": "Top up the paymaster or switch to Expert mode to cover gas yourself."
  },
  "VALIDATION_TIMEOUT": {
    "message": "Validator checks didn’t finish in time.",
    "hint": "Retry in a moment or contact support if the issue persists."
  },
  "DISPUTE_OPENED": {
    "message": "A dispute is already open for this job.",
    "hint": "Wait for the dispute process to finish before taking further action."
  },
  "DISPUTE_OPEN": {
    "message": "A dispute is already open for this job.",
    "hint": "Follow the dispute workflow to resolution before retrying."
  },
  "CID_MISMATCH": {
    "message": "The attachment CID does not match the orchestrator record.",
    "hint": "Re-upload the artifact and confirm the CID before resubmitting."
  },
  "RPC_TIMEOUT": {
    "message": "The blockchain RPC timed out.",
    "hint": "Retry shortly or point Advanced settings at a faster RPC endpoint."
  },
  "UNKNOWN_REVERT": {
    "message": "The transaction reverted unexpectedly.",
    "hint": "Review orchestrator logs or rerun in Expert mode for detailed revert data."
  },
  "IPFS_TEMPORARY": {
    "message": "The pinning service is busy.",
    "hint": "Wait a moment and re-upload your request."
  },
  "IPFS_FAILED": {
    "message": "I couldn’t package your job details.",
    "hint": "Remove broken links or attachments and try again."
  },
  "RELAY_UNAVAILABLE": {
    "message": "The relayer is offline right now.",
    "hint": "Switch to wallet mode or retry shortly."
  },
  "JOB_ID_REQUIRED": {
    "message": "Provide the jobId you want me to act on before continuing.",
    "hint": "Paste the job number from your receipt or status list."
  },
  "JOB_BUDGET_CAP_EXCEEDED": {
    "message": "Requested reward exceeds the configured cap for your organisation.",
    "hint": "Lower the reward or update the org policy before executing."
  },
  "JOB_DEADLINE_CAP_EXCEEDED": {
    "message": "Requested deadline exceeds the configured cap for your organisation.",
    "hint": "Shorten the deadline or adjust the org policy before executing."
  },
  "REWARD_INVALID": {
    "message": "Enter the reward as a numeric AGIALPHA amount before submitting.",
    "hint": "Use a positive number such as 5 or 10.5."
  },
  "JOB_ALREADY_FINALIZED": {
    "message": "That job is already finalized.",
    "hint": "Choose a different job or request a status update instead."
  },
  "JOB_IN_DISPUTE": {
    "message": "That job is currently disputed.",
    "hint": "Resolve the dispute before finalizing."
  },
  "JOB_NOT_READY_FOR_FINALIZE": {
    "message": "This job is still in progress.",
    "hint": "Wait until it’s completed and validators have approved before finalizing."
  },
  "STATUS_UNKNOWN": {
    "message": "I couldn’t confirm the job status.",
    "hint": "Retry once the network responds or check later."
  },
  "PLAN_HASH_REQUIRED": {
    "message": "Send the plan hash from the planning step so I can link this request to its original plan.",
    "hint": "Re-run planning if you no longer have the plan hash."
  },
  "PLAN_HASH_INVALID": {
    "message": "Use the 32-byte plan hash from the planning step before continuing.",
    "hint": "Copy the full hex string that starts with 0x."
  },
  "PLAN_HASH_MISMATCH": {
    "message": "The plan hash doesn’t match this request.",
    "hint": "Re-run planning and retry with the latest hash."
  },
  "PLAN_HASH_UNKNOWN": {
    "message": "The plan hash is not recognised or has expired.",
    "hint": "Call /onebox/plan again to generate a fresh plan before simulating or executing."
  },
  "UNSUPPORTED_ACTION": {
    "message": "I didn’t understand that action.",
    "hint": "Rephrase the request or choose a supported workflow."
  },
  "UNKNOWN": {
    "message": "Something went wrong.",
    "hint": "Retry once and contact support with the reference code if it persists."
  },
  "ORCHESTRATOR_NOT_CONFIGURED": {
    "message": "Connect an orchestrator under Advanced → Orchestrator URL, then run the job again.",
    "hint": "Paste the orchestrator endpoint and save before sending new requests."
  },
  "API_TOKEN_MISSING": {
    "message": "Add your orchestrator API token under Advanced → API token and resend the request.",
    "hint": "Copy the token from the orchestrator console."
  },
  "API_TOKEN_INVALID": {
    "message": "The API token was rejected.",
    "hint": "Mint a fresh token in the orchestrator console, update Advanced → API token, and retry."
  },
  "IDENTITY_NOT_CONFIGURED": {
    "message": "This orchestrator is missing its identity pack.",
    "hint": "Sync the ENS roots or identity bundle and restart the orchestrator before retrying."
  },
  "ESCROW_BALANCE_LOW": {
    "message": "Escrow balance is too low.",
    "hint": "Top up the funding wallet or lower the reward, then try again."
  },
  "ESCROW_ALLOWANCE_REQUIRED": {
    "message": "Escrow allowance is missing.",
    "hint": "Approve AGIALPHA spending (Expert mode or wallet) and rerun the request."
  },
  "BLOCKED": {
    "message": "Policy checks blocked this plan.",
    "hint": "Provide the missing fields or adjust the budget before continuing."
  },
  "OVER_BUDGET": {
    "message": "Simulation detected the plan is over budget.",
    "hint": "Lower the reward or raise the cap before retrying."
  },
  "RUN_NOT_FOUND": {
    "message": "The run status could not be located.",
    "hint": "Refresh the page and try again."
  },
  "RUN_FAILED": {
    "message": "The orchestrator reported a failure while executing the plan.",
    "hint": "Review the logs, address the issue, and resubmit once resolved."
  },
  "DEFAULT_REWARD_APPLIED": {
    "message": "Demo mode applied a default reward for you.",
    "hint": "Set an explicit reward before running this plan in production."
  },
  "DEFAULT_DEADLINE_APPLIED": {
    "message": "Demo mode applied a default deadline for you.",
    "hint": "Choose a deadline that matches your requirements before executing for real."
  },
  "LOW_REWARD": {
    "message": "The reward looks low for this type of job.",
    "hint": "Consider increasing the payout so qualified agents stay interested."
  },
  "SHORT_DEADLINE": {
    "message": "The deadline is very tight.",
    "hint": "Give agents more than two days when possible to reduce risk."
  },
  "LONG_DEADLINE": {
    "message": "The deadline is unusually long.",
    "hint": "Shorten the window to keep the work moving."
  },
  "STATUS_UNCERTAIN": {
    "message": "I could not confirm the current status.",
    "hint": "Retry after syncing with the network."
  },
  "TOOL_NOT_ALLOWED": {
    "message": "This plan requires a tool that isn’t approved for your organisation.",
    "hint": "Remove the tool from the request or update your policy whitelist before proceeding."
  }
}
